app/views/actions/edit.html.erb

 <ul>
<% User.all.each do |d|%>
---
SELECT "users".* FROM "users"