app/controllers/sessions_controller.rb

def create

  @user = User.find_by_email(params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "skramesh@qwinix.io"]]